[
  {
    "name": "Annette Johnston",
    "rating": "5 stars",
    "text": "Inhause Living recently completed our kitchen renovation and part bathroom update First point of call was John Haklani who came out measured up quoted what was to be included in the price package. We were thrilled with John’s knowledge and personable approach. Next up was meeting Joe the project manager, he is the one that gets things done. Joe has his own dedicated team of trades that completed everything to a high standard and timely manner. We were especially impressed with the joinery and the skilled tradesman. Overall we were very happy with the end results. Joe was always available no matter what time of the day we called, he would always respond. John, Joe, and the whole Inhause team were a pleasure to work with including Dora in head office that was always so pleasant and lovely to deal with. Thanks Guys see you on the next project.",
    "date": "3 weeks ago"
  },
  {
    "name": "Sabino Matera",
    "rating": "5 stars",
    "text": "The team at InHaus Living have been fantastic. Their comprehensive service makes things much more at reach. The joint process of renovating my apartment has been great and the project was managed with clarity and ease. The whole team had a great 'can do' attitude and also brought a wealth of knowledge and improvements to the project. Will definitely recommend and will continue to use their service for any future renovations and building projects. Thank you for delivering my newly renovated apartment in time and on budget.",
    "date": "a year ago"
  },
  {
    "name": "Rina McBride",
    "rating": "5 stars",
    "text": "I am extremely happy with my new bathroom renovation, I can not thank the team at Inhaus Living enough. From the beginning concept with John to the end, it was seamless and easy. The team commenced the job while I was overseas, Joe the Project Manager was amazing keeping me up to date and sending regular photos of their progression. I was so incredibly happy to come home to find such a beautiful job and to such a high standard. I highly recommend the quality of workmanship and service provided, I would not hesitate to use the Inhaus Living team again for any future projects. Before and After shots added to show amazing transformation",
    "date": "2 years ago"
  },
  {
    "name": "Ingrid Wagner",
    "rating": "5 stars",
    "text": "Our beautiful little apartment was in need of a renovation when things finally started to fall apart after nearly 50 years! The team at InHaus (Dora, Richard, and Elias) were great to deal with and accommodated all my requests for bespoke finishes. We removed walls, replaced flooring throughout, replaced the entire kitchen and bathroom. We tried to keep a bit of the 1970's flavour of the original finishes but with sleek, modern updates. Wonderful Elias was our project manager and is absolutely fantastic to deal with. We worked through any design challenges that needed ironing out during the build and he was patient and professional. Elias is a very knowledgable builder, he has many years of experience and is precise. We wanted a high-quality renovation that would hopefully last another 50 years, and boy, did we get it! Thanks InHaus for everything!",
    "date": "a year ago"
  },
  {
    "name": "Dane Sharp",
    "rating": "5 stars",
    "text": "Highly recommend Inhaus Living if you're planning a renovation. The entire team did an amazing job - from start to finish. Their support and communication was excellent. They listened, shared their feedback and recommendations, and were great expert collaborators in the endeavour.",
    "date": "3 months ago"
  },
  {
    "name": "grahame oxley",
    "rating": "5 stars",
    "text": "John Haklani the project manager of my Inhaus Living bathroom was excellent. He closely oversaw each step of the project, offered practical advice  and ensured a quality bathroom. Very happy with result.",
    "date": "4 weeks ago"
  },
  {
    "name": "chris furse roberts",
    "rating": "5 stars",
    "text": "I would like to warmly commend John Haklani, Sam Harb and all the team of Inhaus Living for the fantastic renovations they did on my kitchen and bathrooms. John and Sam were a pleasure to deal with and were happy to go out of their way to help. Sam was a great leader of the renovations team. He and John had excellent client relationship skills. The design and quality of Inhaus’s workmanship was first rate and I was very impressed with the final result. I would happily recommend John, Sam and his team at Inhaus Living for any home kitchen or bathroom renovations.",
    "date": "2 years ago"
  },
  {
    "name": "Amy L",
    "rating": "5 stars",
    "text": "Inhaus was amazing. My first time doing a renovation and John was so patient, answering Amy and all questions I had. Joe (project manager) was amazing, got things going quickly and efficiently. Adapted to changes that I wanted to make and was very prompt in their communication. There has been some minor followups to my place and inhaus has been responsive, months after the renovation was fully paid for. Already recommended inhaus to several of my friends and colleagues",
    "date": "a year ago"
  },
  {
    "name": "Carly Solomon",
    "rating": "5 stars",
    "text": "My recent kitchen, laundry and floor renovation has transformed my living space into a haven of efficiency and style. From the start John was amazing, responsive and nothing was a problem. Sam my project manager is the absolute best answered every silly, small question or concern I had. Sam would communicate with me after hours and the weekend as he knew I needed exact timings and every detail. Living alone and trying to navigate a renovation and working 5 days a week in the office was stressful but Sam made it so easy. He coordinated everything amazingly but most importantly he showed so much concern for my cat and made sure she was always safe, and his team would let her out of the room at the end of each day. and I The team behind this renovation deserves nothing short of applause for their meticulous craftsmanship, innovative design, and unwavering attention to detail. Design (5/5): The design concept was nothing short of brilliant. The fusion of modern aesthetics with a practical layout has breathed new life into my home. The kitchen is small and complicated to maximize space btu between John and Sam, the figured it out ensured it was functional and as spacious as possible. Functionality (5/5): Every aspect of the renovation was aimed at enhancing functionality, and it shows in every corner of my kitchen and laundry area. The newly installed smart appliances have streamlined my daily routines, making cooking and cleaning a breeze. The laundry area, previously an afterthought, now boasts an efficient and organized space that makes the chore seem almost enjoyable. Quality of Workmanship (5/5): The craftsmanship displayed by the renovation team was truly outstanding. Mo, who was the joiner, is so lovely and truly went above and beyond for me. Nothing was a problem. Every cabinet, countertop, and tile was installed with precision, creating a seamless and cohesive look. The attention to detail is evident in the flawless grout lines and smooth finishes. It's clear that no shortcuts were taken in achieving this level of perfection. Materials and Finishes (5/5): John and Sam questioned my finishes at times haha, and I took their advice when needed but they knew when I was set on something and then helped me to make the best choice whilst still giving me what I want. Project Management (5/5): As previously mentioned, Sam is just amazing not just as a project manager, but just in general. I have told john that when I renovate my bathrooms with Inhaus I will only go ahead if Sam is my project manager again. In saying that all his contractors, electricians, plumbers, joiners etc were so amazing, punctual, neat, tidy, and respectful. Value for Money (5/5): This renovation has undeniably added significant value to my home. The transformation is so remarkable that it feels like a whole new home. In summary, my kitchen and laundry renovation has exceeded all expectations. It has not only elevated the functionality of my living space but also brought a touch of luxury and sophistication to my everyday life. I wholeheartedly recommend Inhaus living to anyone seeking a seamless blend of functionality and elegance in their home. (painting has not been done and was not part of the renovation scope)",
    "date": "2 years ago"
  },
  {
    "name": "EC Fitzgib",
    "rating": "5 stars",
    "text": "The Inhaus Living team installed a beautiful bathroom for us. From the first meeting with Joe who helped with the design and selection of finish; to Dora who made everything run smoothly; to Sam who managed every aspect of the works for us, we were made to feel consistently comfortable that we were in the best of hands. Communication throughout was amazing where we were kept informed daily of what was happening 2-3 days in advance and then importantly it all happened as planned. I would recommend all the trades connected with the job individually - a marvellous team of impeccable, tidy and genuinely caring individuals. We were never made to feel any request was unreasonable. Throughout the job, quality ideas were suggested that made the finish better than hoped. Of everyone, I would have to call out Sam as one of the overall best contractors (and nicest!) I have dealt with, and I do not say that lightly. In summary, I can only thank the team for our beautiful bathroom and of course, recommend them highly to anyone. We are so impressed that we have asked them to engage with us in the next extensive phase for our home being a new kitchen / living room, including new cabinetry, stone works, timber flooring and windows.",
    "date": "4 years ago"
  },
  {
    "name": "Bernice Kaplan",
    "rating": "5 stars",
    "text": "Highly recommend using Inhaus Living, John was great to begin the process and a special thanks to Elias, project manager and his team for the renovation of my entire two bedroom unit, from floor to ceiling and everything in-between. Nothing was too much trouble. Through all the different stages of the renovation his communication was great and I had a very positive experience. The time frame given was spot on. Absolutely love the new look!",
    "date": "11 months ago"
  },
  {
    "name": "Michael Moses",
    "rating": "5 stars",
    "text": "Overall extremely satisfied. My wife says our bathroom looks like a spa! For context, my wife and I are new homeowners and felt that we could trust Joe, Sam, Dora-Marie and the team with our first bathroom renovation and were very happen to be proven right. Joe did a great job helping us with the design and Sam our project manager was proactive, experienced, helpful and a great communicator. This was particularly important as the NSW Government halted construction in the middle of our project and Sam did an excellent job of orchestrating the job to be finished as quickly as possible in an environment with constantly evolving rules. Further, the team did a great job communicating with our STRATA to address any raised issues and all were resolved ASAP and to the satisfaction of all parties. For any major renovations going forward, we will certainly be giving a call to INHAUS again. Some photos attached, though they do not do it justice.",
    "date": "4 years ago"
  },
  {
    "name": "Anke Vuletic",
    "rating": "5 stars",
    "text": "Inhaus Living has done an extensive renovation on my 1929 apartment. Full kitchen, bathroom, and more. As it happens 1929 buildings provide 'interesting' challenges in a lot of areas you won't find on a more recent build. But no challenge was too big or complex for the team to resolve. Everyone did an exceptional job and was a delight to deal with. When it's your home, you want it done right and not have corners cut or make compromises. I've been in the apartment now for a few weeks and can say no corners were cut, everything is beautiful and functional and as requested. Special shout out to Sam who ran the renovation on site and who had to deal with me on a daily base...god knows I'm not the easiest client. I highly recommend Inhaus Living for any renovation needs you may have, I sure will recommend them to all my friends in the future. (I've attached a 'before' and 'after' photo of my kitchen, so you can see the impact a beautiful and well executed renovation can have on any property)",
    "date": "2 years ago"
  },
  {
    "name": "Adam Sime",
    "rating": "5 stars",
    "text": "I am absolutely thrilled with the results of my new kitchen and engineered flooring installation by InhausLiving! From the initial consultation with Mark to the final touches, their team was professional, attentive, and clearly passionate about quality design and craftsmanship. My kitchen is now the heart of my home—modern, functional, and beautifully finished. The engineered flooring throughout adds a perfect balance of warmth and style. InhausLiving exceeded my expectations in every way, and I wouldn’t hesitate to recommend them (and Mark) to anyone looking to transform their space.",
    "date": "7 months ago"
  },
  {
    "name": "Kevin Leong",
    "rating": "5 stars",
    "text": "IIn June 2018, Inhaus Living renovated three bathrooms and one laundry at my Marrickville home. At 6.50am, each morning, the tradespeople were exceptionally enthusiastic to start work. The all-important workmanship was outstanding. The after sales service was superb. The outcome was marvellous for one main reason: the project manager Sam Harb did a first-class job over eight weeks. Inhaus Living has a laser-like focus on supreme customer satisfaction. Sam Harb, Joe Bazouni, Dora-Marie and Richard are remarkable people that delivered five star hotel-like and premium grade quality bathrooms. I feel extraordinarily fortunate to be involved with such wonderful and incredibly experienced people with substantial renovation expertise. The bathrooms were competitively and sensibly priced. After more than two years since the bathrooms in the house were renovated, my family still thinks the bathrooms are beautiful. In addition, visitors to my Marrickville home admire the premier workmanship quality by Inhaus Living. The bathroom renovation by Inhaus Living has turned out to be an extremely worthwhile lifestyle decision. High quality bathrooms at reasonable prices, top-notch customer service and high-calibre tradespeople are main reasons I have recommended family and friends to Inhaus Living for kitchen and bathroom renovations. Kevin Leong.",
    "date": "5 years ago"
  },
  {
    "name": "Katie Godkin",
    "rating": "5 stars",
    "text": "I can't recommend the team at InHaus Living enough. After several delays with another builder I decided to look elsewhere for help with my renovations, and InHaus were incredibly helpful and efficient, starting within weeks of our initial meeting. My project manager Elias has been fantastic, ready to answer any questions I had, and helping me every step along the way of navigating my first experience with renovating. His extensive experience is obvious as soon as you meet him, and his kindness and warmth of character made the entire process feel easy. The team at InHaus were also extremely respectful of my budget. They did everything possible to help me achieve the result I wanted within the budget I had. I’m so happy with the result, and I would highly recommend InHaus to anyone.",
    "date": "11 months ago"
  },
  {
    "name": "Renee Zhou",
    "rating": "5 stars",
    "text": "We had a full renovation of the house with Inhausliving. It’s our first renovation so of course there are lots of issues, but we are really glad that our PM Jake and our sales person John have always been there supporting us along the way. Thank you!",
    "date": "a year ago"
  },
  {
    "name": "Christina Chang",
    "rating": "5 stars",
    "text": "I couldn’t be happier with the results of my recent renovation! Sam (Harb) and his team were professional, easy to work with, and attentive to my ideas. Sam contributed practical suggestions that really enhanced the project. He is honest, reliable, flexible, and delivered beyond what was promised. The quality of the work is excellent, and the project was completed one week ahead of schedule. I would confidently recommend Sam (and already have) to anyone considering a renovation. I couldn’t have asked for a better experience.",
    "date": "a year ago"
  },
  {
    "name": "Mark McAlary",
    "rating": "5 stars",
    "text": "Sam, Mark and team did an excellent job on updating an old kitchen, including structural work. The design is intuitive and functional, the work was done with good quality workmanship and completed in good time and within budget. They were very responsive and communicative with honest suggestions and positive attitude throughout. Would recommend.",
    "date": "a year ago"
  },
  {
    "name": "Zerah Gallardo",
    "rating": "5 stars",
    "text": "Extremely positive experience with our renovations. The house had a lot of complexity, but our project manager Elias was always on top of all the moving pieces. We were regularly updated on progress, and the renovations ran perfectly on schedule. The team were lovely to work with and quick to provide solutions to problems they found. Really happy with the outcome, and would use them again in a heartbeat.",
    "date": "a year ago"
  },
  {
    "name": "Colin Kerr",
    "rating": "5 stars",
    "text": "Team at Inhaus Living were outstanding.  We had a new bathroom installed. Joe Biviano was easy to deal with when designing our bathroom. Project manager Elias ensured work completed on time and with high quality of installation and finishes. I would highly recommend Inhaus Living.",
    "date": "a year ago"
  },
  {
    "name": "Rob Wolifson",
    "rating": "5 stars",
    "text": "This was our first renovation unexpected due to a waterproofing failure. We were very apprehensive and unsure going in but the team at Inhous Living were a dream to work with. John was extremely helpful working with us from the start in the design stage, material selection and overall concept. Sam our project manager did an amazing job. Everything happened seamlessly as he navigated around our Strata buildings regulations. All of the Tradespeople were first rate. On time, courteous and thoroughly professional as they finished their jobs to the highest standard possible. I will happily recommend Inhous Living to anyone looking for a pain free renovation to be proud of.",
    "date": "2 years ago"
  },
  {
    "name": "William S",
    "rating": "5 stars",
    "text": "We just finished a 6-week kitchen and bathroom renovation made easy by Inhaus team. Job was designed and project managed end to end, finished on time (6 week schedule), on a fixed-fee budget, with attention to detail and quality finishing. John spent hours helping us settle a design for a challenging layout/space. Sam did an A-class job project managing the works to completion and was always responsive and willing to go out of his way to ensure success of the project. Both experienced professionals who know their craft. For top-tier renovation services made easy (even for clueless white-collar professionals like me), go for Inhaus. Thanks John and Sam both legends.",
    "date": "2 years ago"
  },
  {
    "name": "Leonid Petrov",
    "rating": "5 stars",
    "text": "It’s not easy to find a contractor just for a kitchen island, but INHAUS LIVING is a great example of professionalism, flexibility and value for money. Excellent team work and customer service made me and my family very happy.",
    "date": "Edited 4 years ago"
  },
  {
    "name": "Chris",
    "rating": "5 stars",
    "text": "We had existing carpeting and kitchen tiles removed, floor levelling, and then hybrid, stone core floors, fitted throughout our apartment. Mark was very customer focused from start to finish; offering honest advice and options up front, to always looking to be sure we were satisfied with what the team were doing, and available to answer questions. There will always be some minor rectifications, and these were made promptly and without question. We love the look of the new boards.",
    "date": "2 years ago"
  },
  {
    "name": "Andrew Lee",
    "rating": "5 stars",
    "text": "Team at Inhaus Living were outstanding. We had a new bathroom and flooring installed and couldn't recommend more highly. Joe Biviano was a super project manager - great communication, very helpful and on the ball. Dora-Marie, Joe and Mark were all very responsive and easy to deal with. We are very satisfied with the final product. Top quality tradesmen and a very stylish result.",
    "date": "4 years ago"
  },
  {
    "name": "Rob Henderson-Smart",
    "rating": "5 stars",
    "text": "Excellent service, quality and pricing. We found the dedicated project manager ensured work completed on time within budget and with high quality of installation and finishes. The initial design concept input was very helpful in finalising our building plans. We found them to be honest, transparent and nice people to work with. Overall we had a very good experience and we would not hesitate to recommend In Haus",
    "date": "a year ago"
  },
  {
    "name": "Georgie Abdallah",
    "rating": "5 stars",
    "text": "I used Inhaus Living for the renovation of my unit. They completely transformed an original condition apartment to a modern, luxurious apartment within two months. They also managed the communication with a very difficult Strata Manager. I would recommend using their services and will no doubt be using them again. Really appreciate the help from Sam, Richard and Dora. Great team, delivering excellent results.",
    "date": "4 years ago"
  },
  {
    "name": "Angela Papazoglou",
    "rating": "5 stars",
    "text": "This is my second renovation with Inhaus Living. The first was a bathroom 4 years ago. All the tradespeople involved not only showed up on time every day but were enthusiastic about doing so. Joe was the project manager on that renovation and not only did he do a wonderful job, Inhaus also finished the job according to the schedule of works. I cannot recommend them highly enough – so much so that I have just finished my kitchen renovation (just now). Sam the project manager on this renovation was outstanding. No issue or concern was ever a problem. I was kept informed daily to let me know at what stage the renovation was coming along. Every question I had was answered and Sam’s reassurance and kind nature was without question a huge PLUS. Sam was exceptional in terms of organising and ensuring the highest standard of work. Inhaus Living pride themselves in customer satisfaction and treat their customers like family and I absolutely have no hesitation in recommending them.",
    "date": "5 years ago"
  },
  {
    "name": "ger d",
    "rating": "5 stars",
    "text": "I had quite major renovations done to my house, bathroom, kitchen, structural changes, flooring, ceiling, painting, new decking with roof and the output from Inhaus Living exceeded expectations. Every vistor I had has been very impressed with what they have done and commented how beautiful my place is. What impressed me more is the service provided by the team, with Sam as the project manager. He answered my questions very promptly, even though I was in contact almost on daily basis for a few months, but still remained patient and always made sure that my mind was at ease. I will surely recommend Inhaus Living to anyone seeing any renovation work as the work they do is at a very high standard complemented with exceptional service. I will definitely be seeking their services again if they are available! Many thanks Sam and the rest of the team!",
    "date": "4 years ago"
  },
  {
    "name": "Garth Ross",
    "rating": "5 stars",
    "text": "In Haus living have recently converted a three-way to one large bathroom and a laundry to a laundry/bathroom. John designed both which included several onsite visits and assisted with our tile/PC selections. the results are above our expectations and in line with our budget. He said he wanted a wow factor, this is the actual word used by people seeing both for the first time. The project managers were also very professional, customer focussed and technically very knowledgeable. They would be onsite at the start and completion of tasks to ensure quality and peace of mind for the client. The tradesmen were not only of a high standard but a pleasure to have in our house. We would recommend InHaus as they demonstrated to us quality of product and customer service.",
    "date": "2 years ago"
  },
  {
    "name": "Anna Gellatly",
    "rating": "5 stars",
    "text": "INHAUS LIVING I have found to be consistently pleasant, dedicated and personable team with an extensive knowledge in bathroom renovations. From start to finish I was at ease!! In addition to the above, Jeo at the beginning with his design , Dora in the office and Jake - project manager , during whole renovation has a take-charge personality and is able to tackle the most difficult tasks with confidence and a smile. They successfully turned around the very difficult bathroom I had, with great ideas to help me personally and a kind smile at all times. The crew that were working with them were professional , on time, polite and sharp on every detail!! I am very pleased and highly highly recommend their services ! 😊",
    "date": "5 years ago"
  },
  {
    "name": "Lucas Lixinski",
    "rating": "5 stars",
    "text": "We did two bathrooms at the same time. As with any big renovation, there are always unforeseen issues and little hiccups, but what matters is how those problems are addressed. The team was always thoroughly professional and prompt in resolving everything that came up. They were always on time, and great with communicating about different stages of the project so we were always aware of what was happening. Joe, our site / project manager, was a stand-out in terms of competence and holding every one working on the project to very high standards of both work ethic and results. Compared to other renovation work we did and project managed ourselves, this process was efficient and very, very worth it. We would definitely come back to InHaus with other renovation projects and recommend them to anyone who wants to do a renovation.",
    "date": "5 years ago"
  },
  {
    "name": "meredith young",
    "rating": "5 stars",
    "text": "We worked with INHAUS to renovate our main bathroom and ensuite and transform our downstairs area into a combined laundry and bathroom. Alongside this major renovation, INHAUS also built a beautiful linen press, wardrobe space in our third bedroom and also installed a glass sliding door to upgrade the side entry to our home. All of this work saw our seriously outdated home (which had not had work done to it since it was built 50 odd years ago), beautifully renovated over 13 weeks. We loved working with Sam as our project manager who worked tirelessly with his team to deliver us our dream family home. While there might have been a few small hiccups along the way (which is to be expected with any renovation), there was no hesitation from Sam and his team to fix the problem. Our build was completed on time and within budget. couldn’t be happier and we can’t speak highly enough of Sam and the INHAUS team.",
    "date": "Edited 4 years ago"
  },
  {
    "name": "Adam Cooper",
    "rating": "5 stars",
    "text": "Massive thanks and appreciation to Sam and the team at INHAUS Living! The team did an amazing job on the full renovation of our one bedroom apartment - including the kitchen, bathroom, laundry, flooring, painting, carpeting, lighting and wardrobe interiors. The team were very patient with us as we went through the process of trying to choose the different colours, designs and materials etc and were very accommodating each time we changed our mind! They were very honest and up front about everything - from the costs (which came in on budget) to the timing (they said it would take 8 weeks minimum and it took exactly that - to the day!). Most impressively, they understood our needs and what was important to us, with Sam anticipating our requests ahead of time and organising special finishing touches that we didn’t even have to ask for! Most importantly though, the finish of their work was outstanding. I am quite pedantic and was obsessing over the smallest of things, like the lining up of the tiles in the bathroom. The team had everything perfectly aligned and finished off to highest standard. The work they have done is truly transformative! Thanks so much to Sam and the team - I’d highly recommend them to anyone else wanting to renovate all or part of their home!",
    "date": "4 years ago"
  },
  {
    "name": "Val TIOUPIKOV",
    "rating": "5 stars",
    "text": "Inhaus Living has renovated 2 bathrooms in our apartment. The job was done on very professional level with highly skilled tradesmen. Special thank you to Sam, the project manager, who had perfectly managed the project from the first day to the last day. Well done and many thanks.",
    "date": "4 years ago"
  },
  {
    "name": "Carla Efstratiou",
    "rating": "5 stars",
    "text": "We just completed the renovation of our bathroom with Inhaus Living and are very happy with the results. Jake and the team were professional and very easy to deal with. Everything ran smoothly with Jake organising every aspect of the renovation. We would definitely recommend them to anyone looking to update their bathroom.",
    "date": "3 years ago"
  },
  {
    "name": "thomas wescon",
    "rating": "5 stars",
    "text": "Jake was our project manager for 2 bathrooms and our kitchen remodeling. On all projects the tradesman were careful, polite and on time, as much as they possibly could due to weather and materials. The projects were finished in a reasonable amount of time and to our personifications. We were very pleased and satisfied with the end results. yours sincerely Tom Wescon",
    "date": "5 years ago"
  }
]