{
  "slug": "apartment-renovation-bellevue-road-bellevue-hill",
  "title": "Bellevue Road, Bellevue Hill",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/Rectangle%20177%20(11).png",
  "content": "Located in the heart of Bellevue Hill, this apartment renovation reimagines an ageing residence into a calm, light-filled and contemporary home. The brief called for a transformation that would enhance spatial flow, maximise natural light and introduce timeless finishes, while maintaining a sense of understated elegance suited to apartment living. The design approach focused on creating a seamless open-plan layout, allowing the kitchen, dining and living areas to function as one cohesive space. By removing unnecessary partitions, the apartment was opened up both physically and visually, resulting in improved circulation, enhanced daylight penetration and a greater sense of scale within the existing footprint. A streamlined, handle-less kitchen anchors the main living zone. Finished in soft white tones, it establishes a clean and refined backdrop, while a contrasting grey island with a rebated waterfall edge introduces depth and subtle architectural interest. The restrained palette allows form, proportion and material quality to take precedence, reinforcing the project’s calm and contemporary character. Timber flooring was installed throughout the apartment to unify the spaces and add warmth and texture underfoot. This natural material softens the modern interior and provides visual continuity from room to room, contributing to the overall sense of flow. The bathroom was redesigned as a spa-inspired retreat, balancing minimalism with tactile richness. A two-toned freestanding bathtub acts as the focal point, complemented by stone-textured feature tiles and brushed metal fixtures. Together, these elements create a space that feels refined, serene and intentionally detailed. Throughout the apartment, neutral tones, layered textures and carefully considered details work together to establish a sophisticated yet inviting atmosphere. The result is a home that feels modern without being transient — a thoughtfully resolved renovation that enhances everyday living while standing the test of time."
}