{
  "slug": "apartment-renovation-maclaey-street-elizabeth-bay",
  "title": "Maclaey Street, Elizabeth Bay",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/Rectangle%20177%20(12).png",
  "content":"This apartment renovation in Elizabeth Bay sought to refresh a classic residence while carefully preserving its original character. The brief focused on creating a bright, modern interior that felt calm, refined and personal, balancing contemporary upgrades with respect for the apartment’s inherent charm. The design approach considered the apartment as a whole, prioritising spatial clarity, functionality and light. Through thoughtful planning and selective interventions, the renovation enhances everyday usability while allowing the existing architectural qualities to remain present and legible. A reconfigured open-plan layout connects the kitchen, living and dining areas, improving circulation and visual flow throughout the apartment. The removal of non-structural walls allows natural light to penetrate deeper into the interior, resulting in a more open and expansive atmosphere within the original footprint. The kitchen was designed as a streamlined and integrated space, featuring custom minimalist joinery that reduces visual clutter and promotes simplicity. Integrated appliances and stone benchtops create a cohesive and refined composition, while subtle textural contrasts add depth without overwhelming the space. The result is a kitchen that is both highly functional and visually restrained. The bathroom was conceived as a contemporary retreat, drawing on spa-inspired principles of calm and balance. Clean lines and a soft, neutral palette establish a sense of quiet luxury, while a freestanding bathtub acts as a sculptural focal point. Matte black tapware and fixtures introduce contrast and definition, grounding the space within the broader design language of the apartment. The completed renovation delivers a home that feels modern yet enduring, thoughtfully updated without erasing its past. Through careful material selection, considered layout changes and an emphasis on functional elegance, the Maclaey Street Apartment reflects Inhaus Living’s approach to apartment renovation — refined, practical and designed for everyday living."
}