{
  "slug": "bathroom-and-kitchen-renovation-rosehill-street-redfern",
  "title": "Rosehill St, Redfern",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/10.webp"
  ],
      "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/10.webp"
],
  "content": "This kitchen and bathroom renovation in Redfern was conceived to deliver a modern, highly functional home defined by clarity, efficiency and considered material choices. The brief focused on achieving a fresh, contemporary interior that would perform well over time, balancing visual restraint with everyday practicality. The design approach prioritised clean lines, efficient layouts and finishes selected for durability and ease of maintenance. Rather than relying on excess, the renovation demonstrates how thoughtful design decisions can elevate compact spaces while remaining grounded in functionality and longevity. The kitchen was designed with a streamlined configuration to optimise workflow and maximise usable space. Crisp white cabinetry establishes a bright and open foundation, enhancing the sense of light within the apartment. Black fixtures were introduced as a contrasting element, adding definition and a contemporary edge without overpowering the space. Integrated appliances reinforce a clean, uncluttered aesthetic, allowing the joinery and proportions to take precedence. In the bathroom, a restrained neutral palette creates a calm and timeless atmosphere. Sleek black tapware provides contrast and continuity with the kitchen, while a glass shower enclosure improves light flow and spatial openness. A feature wall adds depth and visual interest, grounding the minimalist design with subtle character. Material selections throughout the project were guided by performance, durability and visual consistency. Finishes were chosen to withstand daily use while remaining low maintenance, supporting a practical and enduring interior suited to modern living. The completed renovation delivers a cohesive and well-resolved apartment, where kitchen and bathroom design work together as part of a unified whole. The result is a home that feels contemporary and considered — refined in appearance, efficient in function and designed to stand the test of time."
}