{
  "slug": "bathroom-renovation-woodward-st-coogee",
  "title": "Woodward St, Coogee",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/07.webp"
  ],

    "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/07.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/Intersect%20(1).png",
  "content": "This bathroom renovation in Coogee was designed to transform a tired interior into a calm and functional retreat, drawing inspiration from its beachside setting while maintaining a refined, contemporary aesthetic. The brief called for spaces that feel relaxed yet considered, balancing coastal sensibility with practical, everyday use. The design approach focused on reworking the layout and material palette to enhance flow, light and visual clarity. Modern detailing was layered with timeless elements to ensure the bathrooms feel enduring rather than trend-driven, responding both to the home’s context and the client’s lifestyle. In the main bathroom, a freestanding matte black bathtub acts as a sculptural focal point, introducing contrast and a strong visual anchor within the otherwise light interior. Marble-look porcelain tiles were used across the floors, niches and feature walls, reflecting natural light while adding subtle movement and texture to the space. Matte black tapware and shower fittings reinforce a cohesive design language, bringing definition and a contemporary edge. A secondary bathroom was designed with its own distinct identity, featuring a bold blue tiled feature wall that introduces colour and personality. This contrast provides a playful yet controlled variation, complementing the primary bathroom while maintaining overall cohesion. Across both spaces, the palette of black and white tones, layered textures and clean lines creates a sense of openness and ease. The result is a pair of bathrooms that feel both elevated and relaxed — spaces that perform efficiently while offering a calm, coastal-inspired atmosphere suited to everyday living."
}