{
  "slug": "brompton-road-kensington",
  "title": "Brompton Road, Kensington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/07.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/Rectangle%20177%20(4).png",
  "content": "This renovation on Brompton Road in Kensington reimagines the home as a refined yet welcoming sanctuary, blending contemporary comfort with a timeless design sensibility. The brief called for a cohesive interior that flows naturally from space to space, while allowing each area to retain its own identity and purpose. The design approach focused on continuity, warmth and material richness. A palette of soft neutrals is layered with textured finishes, timber-look joinery and carefully selected stone surfaces to create an interior that feels both elevated and enduring. Slim shaker cabinetry provides a subtle nod to classic detailing, reinterpreted through a modern lens, while updated lighting enhances both functionality and atmosphere throughout the home. The bathrooms were designed to evoke a sense of calm, hotel-inspired luxury. Marble-look feature tiles introduce depth and visual interest, balanced by brushed nickel tapware and frameless glass detailing for a clean and contemporary finish. Integrated storage solutions and stone splashbacks were seamlessly incorporated, ensuring the spaces remain highly functional without compromising visual clarity. At the centre of the home, a two-tone kitchen anchors the living areas. Dark timber cabinetry on the upper level contrasts with soft white lower cabinetry, creating a balanced and inviting composition. Calacatta Plato stone benchtops and splashbacks introduce refinement and durability, while integrated appliances and mirrored bar shelving add a modern, considered layer. Subtle LED lighting enhances usability and contributes to a warm, ambient atmosphere. Living and dining spaces were transformed through custom joinery, curated furnishings and statement lighting. Soft neutral carpeting adds comfort, while accents of deep green and black introduce depth and contrast. Purposefully designed zones, including a welcoming study nook and a refined master bedroom, reinforce the home’s functional versatility. This cohesive design language extends outdoors to the balcony and rooftop terrace, ensuring a seamless connection between interior and exterior spaces. The Brompton Road Residence demonstrates the impact of thoughtful design and attention to detail. Through bespoke joinery, refined material selections and a clear spatial narrative, the project delivers a timeless home defined by warmth, elegance and modern liveability — designed to be enjoyed well into the future."
}