{
  "slug": "clareville-ave-duplex-2-sandringham",
  "title": "Clareville Avenue Duplex 2 – Sandringham",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/05.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/Rectangle%20177.png",
  "content": "Designed as a contemporary duplex with a relaxed coastal sensibility, this home on Clareville Avenue balances refined detailing with effortless liveability. The brief focused on creating a bright, airy residence that supports everyday comfort while delivering a sense of quiet luxury, with strong connections between indoor and outdoor spaces. The design approach embraces a modern coastal aesthetic through clean lines, carefully layered materials and a light-filled spatial arrangement. Throughout the home, refined finishes and thoughtful detailing work together to create a cohesive interior that feels calm, open and enduring. Bathrooms were conceived as feature spaces within the home, combining bold elements with restrained composition. In the main bathroom, a freestanding black and white bath is positioned against a marble-look feature wall, establishing a strong visual focal point. Illuminated niches and statement lighting introduce a sense of drama, while clean-lined fixtures and dark tiled accents maintain balance and sophistication. The open-plan living areas were designed to maximise natural light and spatial flow. Living, dining and kitchen zones connect seamlessly, supported by generous openings and large windows that enhance the relationship between inside and out. This layout promotes a sense of openness while remaining highly functional for everyday living and entertaining. The kitchen continues the home’s refined material language, combining practicality with understated elegance. Marble benchtops introduce a timeless quality, anchoring the space while allowing it to integrate seamlessly with the surrounding living areas. Outdoor living plays a central role in the project. A timber-finished alfresco zone extends the interior living space, creating an inviting environment for year-round entertaining. Complete with a covered dining area and built-in jacuzzi, the outdoor space offers a balance of luxury and relaxation, reinforcing the home’s coastal lifestyle focus. The completed duplex presents as a cohesive and contemporary residence, where clean lines, considered materials and a strong indoor–outdoor connection define the experience of the home. Clareville Avenue Duplex 2 reflects Inhaus Living’s approach to modern residential design, refined, functional and designed for effortless everyday living."
}