{
  "slug": "renovation-dillon-street-residence",
  "title": "Dillon Street, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2749.jpg",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2646.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2561.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2640.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2599.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2637.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2685.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2689.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2700.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2628.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2732.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2738.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2749.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2755.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2476.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2525.jpg",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2777.jpg"
  ],
  "listGallery": [
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2561.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2646.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2738.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2749.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2476.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2525.jpg",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Paddington%202/0Q8A2777.jpg"
],
  "content": "The Dillon Street Residence is a renovation and extension project located in Paddington, designed to enhance both spatial functionality and visual identity within a classic inner-city home. The brief focused on expanding the kitchen and living areas, creating a more generous and connected heart to the home while respecting the existing architectural character. From the outset, the client expressed a strong affinity for green tones, which became a defining element of the design. This preference informed the material and colour strategy throughout the project, resulting in a cohesive palette that feels personal, considered, and timeless. Green cabinetry forms the foundation of the kitchen design, complemented by marble surfaces featuring subtle green veining, allowing the materials to work in harmony with both the client’s vision and the home’s context. The kitchen and living extension was designed to feel seamless and light-filled, improving everyday usability while maintaining a refined aesthetic. Custom joinery plays a key role, balancing visual presence with functionality and ensuring the space feels both elevated and practical. A concealed home office solution was integrated into the joinery, responding to contemporary living requirements. When closed, the desk reads as a standard cabinetry unit, maintaining visual simplicity. When opened, it reveals a fully functional workspace complete with desk and seating, demonstrating a thoughtful approach to flexible living and space optimisation. This same philosophy extends to the laundry, which is fully integrated and concealed within custom cabinetry, allowing utility functions to remain hidden from view. Flooring was updated throughout the home to ensure continuity between existing and new spaces, reinforcing a sense of cohesion across the renovation. In the bathroom, green tiles were selected to complement the broader material palette, extending the client’s colour preference into the private areas of the home while maintaining balance and restraint. The consistent use of colour and material across spaces strengthens the overall design narrative and enhances the sense of unity throughout the residence. The Dillon Street project reflects a considered approach to inner-city renovation, where client-led colour choices, bespoke joinery solutions, and carefully planned extensions come together to create a home that is functional, expressive, and well resolved, designed to support modern living while retaining a strong sense of identity."
}