{
  "slug": "duplex-clareville-ave-duplex-1-sandringham",
  "title": "Clareville Avenue Duplex 1 – Sandringham",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-sutherland-cr-darling-point/Rectangle%20177%20(1).png",
  "content": "Located in the bayside suburb of Sandringham, this duplex was designed as a modern coastal retreat that balances refined detailing with everyday functionality. The brief focused on creating a bright and airy home with a strong sense of flow, supported by quality finishes and a seamless connection between indoor and outdoor living. The design approach brings together clarity of layout and restrained material selection. By prioritising openness and natural light, the interiors feel expansive and inviting, while remaining practical for daily family life and entertaining. An open-plan configuration anchors the home, allowing the living, dining and kitchen areas to function as a cohesive whole. Generous glazing and well-considered openings enhance daylight penetration and reinforce the connection between interior spaces and the surrounding environment. The kitchen acts as both a functional workspace and a visual focal point within the home. Two-toned cabinetry introduces depth and contrast, while a marble island with a rebated waterfall edge adds a sense of refinement and architectural interest. Clean lines and integrated elements ensure the space remains streamlined and efficient for everyday use. The bathroom was designed as a contemporary retreat, defined by calm proportions and considered detailing. A striking double shower forms the centrepiece, featuring a marble-look feature wall and raised platform that adds dimension and presence. Minimalist tapware and carefully selected finishes reinforce the sense of understated luxury throughout the space. The completed duplex delivers a home that feels modern, welcoming and well resolved. Through thoughtful planning, cohesive material choices and an emphasis on light and flow, Clareville Avenue Duplex 1 reflects Inhaus Living’s approach to residential design, refined, functional and closely connected to its coastal context."
}