{
  "slug": "full-home-renovation-mccarrs-creek-road-church-point",
  "title": "McCarrs Creek Road, Church Point",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/10.webp"
  ],
  "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/10.webp"
],
  "content": "This full home renovation in Church Point reimagines a traditional residence as a light-filled, contemporary sanctuary closely connected to its natural surroundings. The brief focused on creating an open and inviting home that supports everyday comfort while offering an ideal setting for relaxed living and entertaining. The design approach considered the home as a whole, with layouts reconfigured to improve spatial flow, functionality and visual connection between rooms. By prioritising openness and clarity, the renovation enhances both the experience of the interior and its relationship to the outdoors. Open-plan living forms the foundation of the design. Expansive glazing and large sliding doors were introduced to connect the main living spaces with a newly designed outdoor entertaining area. This seamless indoor–outdoor transition allows natural light to flood the interiors and reinforces a sense of openness throughout the home. The kitchen was conceived as the central gathering space, combining crisp white cabinetry with warm timber accents to achieve a balanced and timeless aesthetic. A streamlined island bench anchors the space, offering both practicality and a refined focal point for family life and casual entertaining. Bathrooms were redesigned with a restrained and elegant material palette. Neutral tones, marble-look finishes and minimalist fixtures create calm, spa-inspired environments that feel both luxurious and enduring. Each space was resolved with simplicity and longevity in mind. Timber flooring was selected to introduce warmth and natural texture throughout the home, grounding the contemporary design and providing cohesion across all living areas. The completed renovation delivers a cohesive and welcoming residence that blends modern design with a sense of warmth and ease. Through thoughtful planning, considered material selection and strong indoor–outdoor connections, the McCarrs Creek Road Residence reflects Inhaus Living’s approach to full home renovation — refined, functional and deeply connected to its setting."
}