{
  "slug": "full-home-renovation-mermaid-avenue-maroubra",
  "title": "Mermaid Avenue, Maroubra",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/10.webp"
  ],
  "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/10.webp"
],
  "content": "This full home renovation in Maroubra was designed to support the dynamic needs of a young family while embracing the relaxed character of coastal living. The brief focused on creating a home that feels open, connected and highly functional, with shared spaces that encourage interaction and a calm, beach-inspired aesthetic throughout. The design approach prioritised clarity of layout, natural light and ease of movement. By focusing on simplicity and flow, the renovation delivers interiors that feel airy and welcoming, while remaining practical for everyday family life. Open-plan living areas were carefully configured to maximise natural light and take full advantage of expansive ocean views. Large windows and sliding glass doors establish a strong indoor–outdoor connection, allowing the home to respond naturally to its coastal setting and supporting a relaxed, beachside lifestyle. The kitchen was designed as the heart of the home, combining crisp white cabinetry with integrated appliances and generous storage. Clean lines and a streamlined layout ensure the space remains organised, efficient and easy to use, supporting both daily routines and family gatherings. Bathrooms were designed with a restrained, neutral palette to create calm and timeless spaces. Contemporary fixtures and minimalist detailing reinforce a sense of simplicity and freshness, ensuring the bathrooms remain enduring and easy to maintain. Warm timber flooring was used throughout the home to provide continuity between spaces, adding texture and natural warmth. This material choice anchors the interior and complements the coastal palette, reinforcing a cohesive design language across the renovation. The completed home is bright, practical and inviting — a space that supports modern family living while remaining closely connected to its coastal context. Mermaid Avenue Residence reflects Inhaus Living’s approach to full home renovation: thoughtful planning, functional design and environments that feel effortless to live in."
}