{
  "slug": "full-home-renovation-newport-beach",
  "title": "Newport Beach",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/10.webp"
  ],
      "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/07.webp"
],
  "content": "This full home renovation in Newport reimagines a traditional family residence as a modern, light-filled sanctuary that reflects the relaxed elegance of coastal living. The brief focused on creating a home that feels calm, open and timeless — a retreat from the pace of everyday life, while remaining warm, practical and inviting. The design approach embraces a contemporary coastal aesthetic, defined by clean lines, natural textures and a restrained, neutral palette. Throughout the home, simplicity and clarity guide the spatial planning, allowing light and materiality to shape the overall experience of the interior. The kitchen was designed as a minimalist, light-filled centrepiece. Crisp white cabinetry, handleless detailing and integrated appliances establish a streamlined and modern foundation, while subtle textural elements and layered lighting add depth and warmth. The result is a space that feels refined yet highly functional, suited to both daily use and casual entertaining. Bathrooms were conceived as spa-inspired retreats, with neutral tones, floating vanities and matte finishes creating a sense of quiet luxury. Fixtures were selected for durability as well as visual consistency, ensuring the spaces remain both elegant and easy to maintain over time. Warm timber flooring was introduced throughout the home to create continuity between spaces and to ground the interior with natural warmth. The timber tones complement the coastal palette, reinforcing a sense of flow and cohesion from room to room. The completed renovation delivers a sophisticated yet relaxed home, where modern design and coastal character are seamlessly balanced. Through thoughtful planning, considered material selection and a restrained aesthetic, the Newport Beach Residence embodies Inhaus Living’s approach to full home renovation, timeless, functional and effortlessly connected to its coastal setting."
}