{
  "slug": "full-apartment-renovation-osullivan-st-rose-bay",
  "title": "O’Sullivan St, Rose Bay",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/10.webp"
  ],
  "listGallery": [
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/07.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/02.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/04.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/05.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/06.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/08.webp",
  "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/09.webp"
],
  "content": "This full apartment renovation in Rose Bay reimagines an older-style residence into a refined, contemporary home designed for both everyday living and entertaining. The brief focused on creating a space that feels modern and expressive, while remaining comfortable, functional and highly adaptable to social use. The design approach centres on openness, material quality and spatial flow. By adopting an open-plan layout, the living areas were reconfigured to maximise space, circulation and visual connection, resulting in an interior that feels light, expansive and effortless to move through. Herringbone timber flooring was introduced throughout the main living zones, adding warmth, texture and a sense of rhythm to the interior. This strong material choice anchors the space while complementing the clean, minimalist aesthetic of the furnishings and finishes. The kitchen was designed as a sleek and practical hub for entertaining. White cabinetry and stainless steel appliances establish a crisp, contemporary foundation, while warm timber accents introduce balance and character. The layout supports efficient movement and easy interaction with adjacent living areas, reinforcing the apartment’s social focus. In the bathroom, a monochrome palette creates a bold yet timeless composition. Black minimalist tapware is paired with a black vanity and white basin, delivering contrast and clarity. Decorative black-and-white tiles introduce visual interest and texture, adding personality while maintaining cohesion within the overall design language. Lighting was carefully considered throughout the apartment to enhance both functionality and atmosphere. Layered illumination highlights architectural features and materials, while ensuring the spaces remain inviting and adaptable from day to night. The completed renovation delivers a sophisticated, light-filled apartment that balances modern elegance with everyday practicality. Through cohesive material selection, thoughtful planning and attention to detail, the O’Sullivan Street project reflects Inhaus Living’s approach to full apartment renovations, refined, functional and designed to support contemporary living and entertaining."
}