{
  "slug": "home-extention-paddington",
  "title": "Liverpool St, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1549.JPG",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1549.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1458.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1417.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1372.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1393.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1399.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1428.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1476.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1555.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1518.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1443.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1559.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1415.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/liverpool%20st/IMG_1489.JPG"
  ],
  "content": "Set within the tightly woven streetscape of Paddington, the Liverpool Street Residence is a carefully considered terrace extension that brings together architecture, interior design, and construction in a cohesive and understated manner. The project responds to the inherent constraints of a traditional inner-city terrace, focusing on spatial efficiency, natural light, and material longevity, while maintaining a timeless and refined aesthetic. The design strategy centres on clarity of layout and continuity between spaces. Rather than introducing overt contrasts, the interior unfolds through a restrained palette and consistent detailing, allowing the architecture and craftsmanship to take precedence. Classic elements are reinterpreted through a contemporary lens, resulting in spaces that feel calm, functional, and enduring. Light plays a defining role throughout the home. Natural daylight is amplified through a new skylight and a carefully controlled palette of soft, neutral finishes, creating a sense of openness within the compact footprint. The kitchen forms the heart of the extension, anchored by a blue feature island that subtly introduces depth and character without disrupting the overall cohesion of the interior. Custom joinery is integral to the project’s success. Designed as both a spatial and organisational tool, it enables generous storage while preserving clean visual lines. The laundry is discreetly concealed beneath the staircase, demonstrating a thoughtful approach to maximising every available volume. In the living area, bespoke joinery integrates storage and media functions seamlessly into the architecture. Material selections were driven by durability, tactile quality, and visual continuity. Engineered stone benchtops and splashbacks provide a robust yet refined surface throughout the kitchen, while warm-toned flooring introduces contrast and softness underfoot. In the powder room, subtle stone textures and warm metal finishes elevate the compact space, reinforcing the project’s focus on detail and restraint. The Liverpool Street Residence exemplifies a measured approach to terrace living, where careful planning, considered materiality, and bespoke solutions work together to enhance everyday functionality. The result is a home that feels quietly resolved, designed to age gracefully within its urban context while meeting the demands of contemporary inner-city life."
}