{
  "slug": "lavender-street-milsons-point",
  "title": "Lavender Street, Milsons Point",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/Rectangle%20177%20(5).png",
  "content": "This ensuite renovation in Milsons Point was designed as a refined private retreat — a space that moves beyond pure functionality to deliver comfort, elegance and a sense of everyday luxury. The brief focused on creating a bathroom that reflects the client’s personal style while remaining timeless, practical and built to endure. The design approach carefully balances elevated aesthetics with thoughtful usability. Each element was selected to contribute to a calm, spa-like atmosphere, while subtle statement features add depth and visual interest without overwhelming the space. A freestanding bath was positioned as the centrepiece of the ensuite, acting as a sculptural focal point and inviting relaxation. Within the shower, a custom bench seat enhances comfort and usability, reinforcing the space’s role as a place to unwind as well as a functional daily environment. A wall-hung vanity with a stone benchtop creates a clean, floating profile, enhancing the sense of openness within the room. LED-lit mirrored cabinetry introduces soft, ambient lighting while providing discreet storage, supporting both practicality and visual clarity. Marble-look tiles were installed full height, from floor to ceiling, to establish a cohesive and luxurious backdrop. The subtle veining adds texture and timeless character, while the continuous application enhances the perception of space and maintains a refined, unified aesthetic. Underfloor heating was integrated to ensure year-round comfort, completing the ensuite’s sense of considered luxury. The completed renovation delivers a sophisticated and serene bathroom that seamlessly blends classic materiality with modern comfort. Through carefully curated finishes, layered lighting and purposeful detailing, the Lavender Street Ensuite reflects Inhaus Living’s approach to bathroom design, elegant, functional and designed to be enjoyed every day."
}