{
  "slug": "full-renovation-river-road-wollstonecraft",
  "title": "River Road, Wollstonecraft",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0749.JPG",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0782.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0804.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0821.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0775%202.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0836%20(1).JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0847.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0860.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0865.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0880.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0922.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_0969.JPG",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/Wollstonecraft/IMG_1100.JPG"
  ],
  "content": "Located in Wollstonecraft, the River Road Townhouse is a considered interior design and renovation project that reimagines contemporary townhouse living through clarity of layout, material restraint, and functional integration. The project was guided by a desire to create a calm and cohesive home, balancing everyday practicality with a refined, design-led approach. The design draws inspiration from Japandi principles, combining warm timber finishes with a soft, neutral palette to establish a sense of quiet simplicity and visual balance. Spatial flow was prioritised throughout the home, allowing each area to transition seamlessly into the next while maintaining a consistent design language across all levels. Custom joinery plays a central role in defining the interior. Designed with clean lines and minimal detailing, it provides generous storage while preserving a sense of openness and visual order. Timber panelling is used as an architectural element, adding warmth, texture, and depth without overwhelming the spaces. The under-stair area was carefully resolved to incorporate discreet storage, ensuring no space within the townhouse footprint was underutilised. The kitchen anchors the main living level, combining soft white cabinetry with timber finishes to create a balanced and welcoming focal point. Engineered stone benchtops and tiled splashbacks offer durability and visual continuity, while integrated LED lighting enhances both functionality and ambience. Living and dining areas were designed to feel light and connected, supporting modern family living and everyday use. Bathrooms and utility spaces continue the same material narrative. Wall-hung vanities with fluted detailing introduce subtle texture, while consistent tile selections across wet areas reinforce cohesion throughout the home. The walk-in robe was designed as a highly functional storage space, prioritising usability without compromising the overall aesthetic. Material selection was guided by longevity, warmth, and consistency. Hybrid timber flooring provides durability while introducing natural character, and brushed nickel tapware adds a restrained, contemporary accent across the kitchen, bathrooms, ensuite, and laundry. The result is an interior that feels resolved, timeless, and well suited to the demands of modern townhouse living."
}