{
  "slug": "terrace-renovation-glenmore-road-paddington",
  "title": "Glenmore Road, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/10.webp"
  ],
      "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/09.webp"
],
  "content": "This renovation of a traditional Paddington terrace sought to breathe new life into a character-filled home while adapting it for contemporary family living. The brief focused on preserving the architectural integrity of the original structure, while introducing modern comforts that enhance functionality, light and spatial flow. Inhaus Living approached the project with a strong respect for the terrace’s heritage. Original details such as decorative cornices, ceiling roses and traditional architraves were carefully retained, ensuring the home’s historic character remained a defining feature. These elements were thoughtfully complemented by modern interventions that feel intentional and restrained. The kitchen was reimagined as a clean, functional heart of the home. Crisp white cabinetry, stone benchtops and integrated high-end appliances establish a timeless foundation, while the streamlined layout supports ease of use and everyday family life. Bathrooms were redesigned with a contemporary sensibility, featuring neutral palettes, refined textures and modern fixtures. These spaces offer a calm, spa-like quality while remaining highly practical and aligned with the home’s overall design language. Spatial reconfiguration played a key role in the renovation. The removal of unnecessary internal walls, combined with considered lighting placement, improved natural light penetration and created a more fluid connection between living areas. The result is a home that feels brighter, more open and easier to inhabit. The completed terrace presents a carefully balanced composition of old and new. Through thoughtful planning, quality finishes and a warm yet restrained palette, the Glenmore Road Terrace has been transformed into a sophisticated urban sanctuary, one that honours its heritage while comfortably supporting modern life in the heart of Paddington."
}