{
  "slug": "terrace-renovation-elfred-street-paddington",
  "title": "Elfred Street, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/Intersect.png",
  "content": "This corner terrace renovation in Paddington was guided by a desire to refresh a character-filled yet dated home and transform it into a warm, functional residence for a growing family. The brief focused on balancing heritage and modernity, preserving the terrace’s architectural soul while introducing contemporary comfort and usability suited to everyday family life. Inhaus Living approached the project with a strong respect for the home’s original fabric. Heritage elements were carefully retained and complemented with modern interventions, allowing old and new to coexist seamlessly. The design strategy was anchored in a refined, cohesive palette that enhances natural light while maintaining a sense of timeless charm. The kitchen was reimagined as a vibrant yet considered centrepiece. Crisp white cabinetry provides a clean foundation, while mint green appliances introduce personality and a subtle sense of playfulness. Gold fixtures add warmth and elegance, elevating the space without detracting from its welcoming, family-oriented character. Bathrooms were updated with a restrained and calming material palette. Soft neutral tones, marble-look tiles and sleek brass fittings create spaces that feel elegant and serene, while maintaining continuity with the kitchen finishes for a cohesive interior language. Throughout the home, spatial planning prioritised light, flow and connection. An open, family-centred layout allows spaces to transition naturally, while thoughtful details, including a sunlit nursery and an inviting courtyard, reinforce a sense of warmth and liveability. These elements work together to create an environment that supports daily routines while offering moments of calm and retreat. The completed home is a thoughtful blend of heritage character and contemporary design. Bright, welcoming and deeply considered, the Elfred Street Terrace reflects a sensitive approach to terrace renovation, one that honours history while shaping a timeless, comfortable home for the next chapter of family life."
}