{
  "slug": "venetia-street-sylvania",
  "title": "Venetia St, Sylvania Waters",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/07.webp"
  ],
      "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/07.webp"
],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/venetia-street-sylvania/Rectangle%20177%20(8).png",
  "content": "This renovation in Sylvania Waters was guided by a clear intention: to preserve the home’s original character while introducing contemporary updates that enhance both functionality and everyday comfort. The brief focused on achieving a timeless result — one that respects the home’s architectural integrity while responding to the needs of modern family living. Inhaus Living approached the project with a balanced design strategy, enhancing existing features while carefully integrating modern elements. The result is a thoughtful transformation that feels cohesive, refined and enduring. Open-plan living was a central focus of the renovation. The layout was reconfigured to improve spatial flow, allowing living areas to connect more naturally and encouraging stronger links between indoor and outdoor spaces. This adjustment maximises natural light throughout the home, creating a brighter, more open environment and a greater sense of ease in daily movement. Material and finish selection played a key role in elevating the home. High-quality materials were chosen for their durability and longevity, while refined finishes introduce a subtle sense of luxury. These selections ensure the spaces remain both visually appealing and practical for everyday use. Throughout the renovation, care was taken to preserve the home’s original architectural language. By retaining key details and proportions, the project maintains its distinctive character while presenting a refreshed and contemporary expression. The completed home presents a harmonious blend of old and new. Spacious, light-filled and well resolved, the Venetia Street Residence reflects Inhaus Living’s approach to renovation, thoughtful planning, quality craftsmanship and design that supports modern family life while honouring the past."
}