{
  "slug": "wallaroy-crescent-woollahra",
  "title": "Wallaroy Crescent, Woollahra",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/07.webp"
  ],
      "listGallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/07.webp"
],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/wallaroy-crescent-woollahra/Rectangle%20176.png",
  "content": "This renovation on Wallaroy Crescent in Woollahra was guided by a desire to create a sophisticated, low-maintenance home that balances timeless elegance with modern comfort. The brief called for a residence that feels refined yet highly functional, a space designed to support everyday living while maintaining a sense of quiet luxury. Every element of the design was carefully considered to enhance spatial flow, usability and visual cohesion. Through thoughtful planning and restrained material selection, the home achieves a calm and inviting atmosphere that reflects the client’s refined aesthetic. The layout was reconfigured to embrace natural light and openness, creating a seamless connection between living, dining and entertaining areas. This open-plan arrangement enhances circulation and allows the interior to feel both expansive and welcoming. The kitchen was designed with a clean, streamlined approach. Crisp white cabinetry paired with integrated appliances delivers a refined and practical composition, allowing the space to function effortlessly while maintaining visual clarity. Bathrooms were conceived as calm retreats, defined by neutral palettes and contemporary fixtures. These spaces reflect an understated sense of luxury, offering comfort and tranquillity without unnecessary embellishment. Warm timber flooring was laid throughout the home, providing continuity and grounding the interiors with natural texture and warmth. This cohesive flooring choice reinforces a sense of balance and unity across all spaces. The completed residence is light-filled, elegant and easy to live in. From the seamless kitchen finishes to the tranquil bathroom environments, every detail contributes to a home that feels both sophisticated and welcoming. Wallaroy Crescent now stands as a refined urban retreat, thoughtfully aligned with the client’s vision for modern elegance and low-maintenance living."
}